NavTree_server/app/controllers/dashboard_controller.rb

  def index
    @secret = current_user.secret
    @edges = Edge.all(:conditions => {:secret_id => current_user.secret.id} ).paginate :per_page => 20, :page => params[:page]
---
SELECT * FROM "secrets" WHERE ("secrets".user_id = 1) LIMIT 1
SELECT count(*) AS count_all FROM "edges" WHERE ("edges".secret_id = 1)