NavTree_server/app/controllers/edges_controller.rb

  def index
    @edges = Edge.all
---
SELECT * FROM "edges"

  def show
    @edge = Edge.find(params[:id])
---
SELECT * FROM "edges" WHERE ("edges"."id" = 1)

  def create
    #Search the url as a node, otherwise create it.
    @node = Node.find_by_url request.headers["HTTP_TAB_URL"]
    if @node.blank? then
      @node = Node.create(:url => request.headers["HTTP_TAB_URL"] )
    end

    #Build and Link the edge to the parent and to the node
    @edge = Edge.new
    @edge.secret = @secret
    @edge.node = @node

    #Find the parent
    unless request.headers["HTTP_TAB_PARENTEDGEID"] == "null" then
      puts "Parent: " + request.headers["HTTP_TAB_PARENTEDGEID"]
      @parent_edge =  Edge.find(request.headers["HTTP_TAB_PARENTEDGEID"].to_i)
      block_access unless @parent_edge.secret == @secret #Security measure
      @edge.parent =   @parent_edge
    end
    #request.headers["HTTP_TAB_EXTRA"]

    if @edge.save then
---
SELECT * FROM "nodes" WHERE ("nodes"."url" = 'http://en.wikipedia.org/wiki/List_of_HTTP_status_codes#5xx_Server_Error') LIMIT 1
INSERT INTO "nodes" ("created_at", "filtered", "updated_at", "url") VALUES('2011-09-13 06:46:07', NULL, '2011-09-13 06:46:07', 'http://guides.rubyonrails.org/layouts_and_rendering.html')
SELECT * FROM "edges" WHERE ("edges"."id" = 41)
INSERT INTO "edges" ("created_at", "updated_at", "ancestry", "secret_id", "node_id", "timeref") VALUES('2011-08-25 16:47:10', '2011-08-25 16:47:10', NULL, 1, 2, 1314290830)