NavTree_server/app/controllers/nodes_controller.rb

SELECT * FROM "nodes"
---
  def index
    @nodes = Node.all

SELECT * FROM "nodes" WHERE ("nodes"."id" = 1)
---
  def show
    @node = Node.find(params[:id])

INSERT INTO "nodes" ("created_at", "filtered", "updated_at", "url") VALUES('2011-08-25 16:38:44', 'f', '2011-08-25 16:38:44', 'http://gmail.com')
---
  def create

    @node = Node.new(params[:node])

    respond_to do |format|
      if @node.save