NavTree_server/app/controllers/tests_controller.rb

  def create

    #debugger

      #Search the url as a node, otherwise create it.
      @node = Node.find_by_url request.headers["HTTP_TAB_URL"]
      if @node.blank? then
        @node = Node.create(:url => request.headers["HTTP_TAB_URL"] )
      end


      #Build and Link the edge to the parent and to the node
      @edge = Edge.new
      @edge.secret = @secret
      @edge.node = @node

      #Find the parent
      unless request.headers["HTTP_TAB_PARENTEDGEID"] == "null" then
        puts "Parent: " + request.headers["HTTP_TAB_PARENTEDGEID"]
        @parent_edge =  Edge.find(request.headers["HTTP_TAB_PARENTEDGEID"].to_i)
        block_access unless @parent_edge.secret == @secret #Security measure
        @edge.parent =   @parent_edge
      end
      #request.headers["HTTP_TAB_EXTRA"]

      if @edge.save then
---
SELECT * FROM "nodes" WHERE ("nodes"."url" = 'asdasd') LIMIT 1
INSERT INTO "nodes" ("created_at", "filtered", "updated_at", "url") VALUES('2011-09-13 05:52:22', NULL, '2011-09-13 05:52:22', 'ALOHA')
SELECT * FROM "edges" WHERE ("edges".secret_id = 1) LIMIT 1
SELECT * FROM "nodes" WHERE ("nodes"."id" = 13)
INSERT INTO "edges" ("created_at", "updated_at", "ancestry", "secret_id", "node_id") VALUES('2011-09-13 06:14:08', '2011-09-13 06:14:08', NULL, 1, NULL)