NavTree_server/app/controllers/tests_controller.rb

  def create

      #Find the parent
      unless request.headers["HTTP_TAB_EDGEID"] == "null" then
        @parent_edge =  nil
      end
      puts request.headers["HTTP_TAB_URL"]

      #Search the url as a node, otherwise create it.
        #Link the node to the secret
      #Build and Link the edge to the parent and to the node
      #{:parent_id => request.headers["HTTP_TAB_EDGEID"],                  :node_url => request.headers["HTTP_TAB_URL"],                   :secret_id => @secret.id, :extra => request.headers["HTTP_TAB_EXTRA"]  }

      #If saved then


      #debugger unless params[:syncing].to_i == 0


      render :json => @secret.nodes.first.to_json
---
SELECT "nodes".* FROM "nodes" INNER JOIN "edges" ON "nodes".id = "edges".node_id WHERE (("edges".secret_id = 1)) LIMIT 1